# SpotElevFlipTextVert Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevFlipTextVert Property
ParameterTypeId Class See Also
---
"Auto Mirror"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevFlipTextVert { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevFlipTextVert As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevFlipTextVert {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace